#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113600078893]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113600078869]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113601655631]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113600078867]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113600078862]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113600078865]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113600078891]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113600078894]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113600078889]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113600078895]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113600078866]
data.sakuracloud_archive.ubuntu_archive: Reading...
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113600510456]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113601655640]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113601655637]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113601655633]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113601655645]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113601655638]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113601655643]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113601655630]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113601655636]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113601655647]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113601655639]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113601655634]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113601655635]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113601655665]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113601655659]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113601655663]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113601655658]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113601655660]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113601655661]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113601655662]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113601655664]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113601655655]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113601655687]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113601655691]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113601655674]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=15770]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # sakuracloud_subnet.bgp_subnet has been deleted
  - resource "sakuracloud_subnet" "bgp_subnet" {
        id              = "15770"
      - ip_addresses    = [
          - "163.43.191.240",
          - "163.43.191.241",
          - "163.43.191.242",
          - "163.43.191.243",
          - "163.43.191.244",
          - "163.43.191.245",
          - "163.43.191.246",
          - "163.43.191.247",
          - "163.43.191.248",
          - "163.43.191.249",
          - "163.43.191.250",
          - "163.43.191.251",
          - "163.43.191.252",
          - "163.43.191.253",
          - "163.43.191.254",
          - "163.43.191.255",
        ] -> null
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601655630" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113601655674" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601655640" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113601655691" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601655647" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113601655687" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                   = "113601655635" -> (known after apply)
        name                 = "k8s-dev-router-1"
      ~ server_id            = "113601655655" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655639" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113601655658" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655645" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113601655659" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655643" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113601655660" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655634" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113601655661" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655637" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113601655663" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655638" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113601655664" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655633" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113601655662" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655636" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113601655665" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601655630",
        ] -> (known after apply)
        id                = "113601655674"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601655640",
        ] -> (known after apply)
        id                = "113601655691"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601655647",
        ] -> (known after apply)
        id                = "113601655687"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks             = [
          - "113601655635",
        ] -> (known after apply)
        id                = "113601655655"
        name              = "k8s-dev-router-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601655639",
          - "113600078891",
        ] -> (known after apply)
        id                = "113601655658"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601655645",
          - "113600078895",
        ] -> (known after apply)
        id                = "113601655659"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601655643",
          - "113600078894",
        ] -> (known after apply)
        id                = "113601655660"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601655634",
          - "113600078867",
        ] -> (known after apply)
        id                = "113601655661"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601655637",
          - "113600078889",
        ] -> (known after apply)
        id                = "113601655663"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601655638",
          - "113600078865",
        ] -> (known after apply)
        id                = "113601655664"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601655633",
          - "113601655631",
        ] -> (known after apply)
        id                = "113601655662"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601655636",
          - "113600078893",
        ] -> (known after apply)
        id                = "113601655665"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_subnet.bgp_subnet will be created
  + resource "sakuracloud_subnet" "bgp_subnet" {
      + id              = (known after apply)
      + internet_id     = "113600078866"
      + ip_addresses    = (known after apply)
      + max_ip_address  = (known after apply)
      + min_ip_address  = (known after apply)
      + netmask         = 28
      + network_address = (known after apply)
      + next_hop        = "163.43.210.4"
      + switch_id       = (known after apply)
      + zone            = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

Plan: 13 to add, 12 to change, 12 to destroy.

Changes to Outputs:
  ~ external_address_range       = "163.43.191.240/28" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>